def solution(N, data_array):
    # 创建必要的数组
    a = [0] * (N + 1)
    s1 = [0] * (N + 2)  # 增加一个额外的空间
    s2 = [0] * (N + 1)
    l = [0] * (N + 2)  # 增加一个额外的空间
    r = [0] * (N + 1)
    ans = -2147483647

    # 填充数组
    for i in range(1, N + 1):
        a[i] = data_array[i - 1]

    mn = 0
    for i in range(N, 0, -1):
        s1[i] = s1[i + 1] + a[i]
        l[i] = s1[i] - mn
        mn = min(mn, s1[i])
        
    for i in range(N - 1, 0, -1):
        l[i] = max(l[i], l[i + 1])

    mn = 0
    for i in range(1, N + 1):
        s2[i] = s2[i - 1] + a[i]
        
        r[i] = s2[i] - mn
        mn = min(mn, s2[i])
    for i in range(2, N + 1):
        r[i] = max(r[i], r[i - 1])

    for i in range(1, N + 1):
        ans = max(ans, r[i - 1] + l[i])

    return ans

if __name__ == "__main__":
    # 你可以在这里添加更多测试用例
    array1 = [-85, -11, 92, 6, 49, -76, 28, -16, 3, -29, 26, 37, 86, 3, 25,
               -43, -36, -27, 45, 87, 91, 58, -15, 91, 5, 99, 40, 68,
               54, -95, 66, 49, 74, 9, 24, -84, 12, -23, -92, -47, 5,
               91, -79, 94, 61, -54, -71, -36, 31, 97, 64, -14, -16,
               48, -79, -70, 54, -94, 48, 37, 47, -58, 6, 62, 19, 8,
               32, 65, -81, -27, 14, -18, -34, -64, -97, -21, -76, 51,
               0, -79, -22, -78, -95, -90, 4, 82, -79, -85, -64, -79,
               63, 49, 21, 97, 47, 16, 61, -46, 54, 44]
    print(solution(5, [1, 2, 3, -1, 4]) == 10)
    print(solution(100, array1) == 1348)